var haerbin = [
    {
        dt:'新品发布',
        dd:['倾城系列', '尚美系列', '拾花系列', '纯韩系列']
    },
    {
        dt:'热门风格',
        dd:['雅致唯美', '时尚简约', '中国古典', '微电影']
    },
    {
        dt:'拍摄基地',
        dd:['爱丽丝庄园', '阳光城堡', '戛纳影城', '韩城金座']
    },
    {
        dt:'最新活动',
        dd:['当季热点', '浪漫花海', '月影星动', '樱花大道']
    }
];
var beijing = [
    {
        dt:'新创场馆',
        dd:['水晶婚礼馆', '璀璨星光馆', '暮夏花园馆', '轻奢名媛馆']
    },
    {
        dt:'真实客片',
        dd:['韩式系列', '中式系列', '花海系列', '城市街拍']
    },
    {
        dt:'拍摄基地',
        dd:['拉菲庄园', '薰衣草庄园', '香榭丽舍庄园', '爱斐城堡庄园']
    },
    {
        dt:'拍摄项目',
        dd:['基地拍摄', '京城旅拍', '全球旅拍', '微电影']
    }
];
var changchun = [
    {
        dt:'品牌介绍',
        dd:['金夫人品牌', '唯映像品牌']
    },
    {
        dt:'摄影团队',
        dd:['轻奢系列', '仪式感系列', '童话系列', '红运中国系列']
    },
    {
        dt:'拍摄基地',
        dd:['北湖梦幻岛', '爱丽丝庄园', '香榭丽舍庄园']
    },
    {
        dt:'拍摄项目',
        dd:['基地拍摄', '全球旅拍', '微电影']
    }
];
var dalian = [
    {
        dt:'热门风格',
        dd:['韩式风', '中式风', '文艺风', '轻奢风']
    },
    {
        dt:'摄影团队',
        dd:['轻奢系列', '仪式感系列', '童话系列', '红运中国系列']
    },
    {
        dt:'拍摄基地',
        dd:['琥珀湾基地', '威尼斯水城', '圣托里尼', '梦想城基地']
    },
    {
        dt:'最新作品',
        dd:['花漾世界', '月影星动', '普罗旺斯', '普罗旺斯']
    }
];
var chengdou = [
    {
        dt:'热门风格',
        dd:['花海纪', '建筑纪', '唯美纪', '城市人文旅拍']
    },
    {
        dt:'拍摄基地',
        dd:['仙境森花馆', '5D特色影棚', '特色中式', '法式浪漫']
    }
];			
var hangzhou = [
    {
        dt:'新品发布',
        dd:['花海系列', '童话系列', '国品系列', '韩式系列']
    },
    {
        dt:'热门风格',
        dd:['韩式风', '中式风', '文艺风', '轻欧风']
    },
    {
        dt:'拍摄基地',
        dd:['悦影莊', '路易威仕', '法曼云境', '爱乐城']
    },
    {
        dt:'专业资源',
        dd:['婚纱旅拍', '婚纱礼服', '妆面造型', '摄影团队']
    }
];

function data ($dom, item) {
    var arr = [];
    item.forEach( function ( v, i ) {
        console.log( v );
        arr.push('<dl>');
            arr.push('<dt>'+ v.dt +'</dt>');
            arr.push('<dd>');
                arr.push('<ul>');
                v.dd.forEach( function ( v2, i2) {
                    arr.push('<li>');
                        arr.push('<a href="javascript:;">'+ v2 +'</a>');
                    arr.push('</li>');
                } );
                arr.push('</ul>');
            arr.push('</dd>');
        arr.push('</dl>');
    });
    $dom.html( arr.join('') );
    console.log( arr.join('') );
}